Tekla Open API Reference for Tekla Structures 2025
AnalysisModelHandler Class
 The AnalysisModelHandler class contains information related to analysis models.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.AnalysisModelHandler
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class AnalysisModelHandler
Public NotInheritable Class AnalysisModelHandler
The AnalysisModelHandler type exposes the following members.
Constructors
Name | Description
AnalysisModelHandler
Initializes a new instance of the AnalysisModelHandler class
Top
Methods
Name | Description
AddLoad
 Adds a load to the analysis model. The ConstructionMethod must be SELECTED_PARTS, SELECTED_PARTS_AND_LOADS or FLOOR_BY_SELECTED_PARTS_AND_LOADS.
AddPart
 Adds a part to the analysis model. The ConstructionMethod must be SELECTED_PARTS, SELECTED_PARTS_AND_LOADS or FLOOR_BY_SELECTED_PARTS_AND_LOADS.
GetActiveModel
 Gets the active model.
RemoveLoad
 Removes a load from the analysis model. The ConstructionMethod must be SELECTED_PARTS, SELECTED_PARTS_AND_LOADS or FLOOR_BY_SELECTED_PARTS_AND_LOADS.
RemovePart
 Removes a part from the analysis model. The ConstructionMethod must be SELECTED_PARTS, SELECTED_PARTS_AND_LOADS or FLOOR_BY_SELECTED_PARTS_AND_LOADS.
SetActiveModel
 Sets the active model. The AnalysisModelName or ID has to be set.
Top
Examples
using Tekla.Structures.Analysis;
public class Class
{
    public void Example()
    {
        Analysis Analysis = new Analysis();
        AnalysisObjectSelector AnalysisObjectSelector = Analysis.GetAnalysisObjectSelector();
        AnalysisObjectEnumerator AnalysisObjectEnumerator = AnalysisObjectSelector.GetAllObjectsWithType(AnalysisObject.AnalysisObjectEnum.ANALYSIS_MODEL, "");
        while(AnalysisObjectEnumerator.MoveNext())
        {
            AnalysisModel AnalysisModel = AnalysisObjectEnumerator.Current as AnalysisModel;
            if(AnalysisModel == null) continue;
        }
    }
}
See Also
Reference
Tekla.Structures.Analysis Namespace